Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: དབང་པོ་སྦྱང་བར་བྱ་བ་དང་། ཉོན་མོངས་པ་སྤངས་པ་མེད་པར་བྱང་ཆུབ་ཀྱི་ཚོགས་ཡོངས་སུ་རྫོགས་པར་བྱེད་མི་ནུས་ཏེ།
en: Without the necessary purification of faculties and abandonment of afflictions they are incapable of completing the equipment for awakening.

source: དེ་བས་ན་དེ་བཞིན་གཤེགས་པ་ཐབས་མཁས་པས་དེ་དག་ལ་དེ་ལྟ་བུའི་མཐུ་མཆོག་དང་ལྡན་པར་མཛད་དོ།
en: Therefore, with skillful means a tathāgata causes them to become endowed with that sort of supreme force.

source: །ཇི་སྐད་དུ་མདོ་སྡེ་གཞན་དག་ལས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་ཉན་ཐོས་རྣམས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་དེ་དག་ཇི་ལྟར་བལྟ་བར་བགྱི། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་ངས་ཉན་ཐོས་རྣམས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་གང་ཡིན་པ་དེ་དག་ནི། རིགས་ལ་བལྟས་ཏེ་ལུང་བསྟན་པའོ།
en: As the other sūtras say: “Lord, how should we view the Tathāgata’s prophesy of śrāvakas to unsurpassed, perfect awakening?”The Lord: “The prophesy of śrāvakas to unsurpassed, perfect awakening is a prophesy that has in view their lineage.” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས། ཉན་ཐོས་ཟག་པ་མ་མཆིས་པ་སྲིད་པར་ཀུན་དུ་སྦྱོར་བ་རྒྱུན་བཅད་པ་རྣམས་རིགས་མཆིས་སུ་ལགས་ཀྱང་ཇི་ལྟར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར།
en: Lord, if even śrāvakas without outflows who have cut the fetters to suffering existence are in the lineage, how will they awaken to unsurpassed, perfect, complete awakening?”

source: རིགས་ཀྱི་བུ་དེ་བས་དཔེ་བསྟན་གྱི་ཉོན་ཅིག།
en: Listen!

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན་རྒྱལ་པོ་རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བ་ལ་བུ་ཞིག་ཡོད་དེ།
en: Child of good family, a king who receives the royal consecration on the crown of his head has a son.

source: དེ་ཡང་བཟོའི་གནས་ཐམས་ཅད་ལ་སློབ་པ་ལས། དེ་དབང་པོ་རྟུལ་ཞིང་དབང་པོ་རྣོ་བ་མ་ཡིན་པས། ཕྱིས་བསླབ་པར་བྱ་བ་གང་ཡིན་པ་དེ་ནི་སྔར་སློབ། སྔར་བསླབ་པར་བྱ་བ་གང་ཡིན་པ་དེ་ནི་ཕྱིས་སློབ་པར་བྱེད་ན།
en: He studies all the sciences but has dull faculties, not sharp faculties, so he studies what you study later earlier, and studies later what you study earlier.

source: རིགས་ཀྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། ཅིའི་རྒྱུ་དེས་རྒྱལ་པོའི་བུ་མ་ཡིན་ཞེས་བྱ་བའམ། གསོལ་པ་བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། །བདེ་བར་གཤེགས་པ་དེ་ནི་མ་ལགས་ཏེ།
en: So, child of good family, what do you think, is that boy, on account of that, not the son of the king?”“Not so, Lord, not so, Sugata.

source: བཅོམ་ལྡན་འདས་དེ་རྒྱལ་པོའི་བུ་ཉིད་ལགས་སོ་ཞེས་བགྱིའོ།
en: You still say of him that he is the king’s son.”

source: །རིགས་ཀྱི་བུ་དེ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་དབང་པོ་རྟུལ་པོ་རིགས་དང་ལྡན་པ་རྣམ་པ་བསྒོམ་པའི་ལམ་གྱིས་སྔར་ཉོན་མོངས་པ་རྣམས་ཟད་པར་བྱས་ནས། ཕྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱེད་ན།
en: The Lord: “In the same way, child of good family, bodhisattvas with dull faculties who are in the lineage, earlier will put an end to afflictions on the path of meditation, and later will fully awaken to unsurpassed, perfect, complete awakening.

source: རིགས་ཀྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས་རྒྱུ་དེས་མངོན་པར་རྫོགས་པར་སངས་མ་རྒྱས་ཞེས་བྱ་བའམ། གསོལ་པ་བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། །བདེ་བར་གཤེགས་པ་དེ་ནི་མ་ལགས་སོ་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་པ་ལྟ་བུའོ།
en: What do you think, child of good family, on account of that will they not have fully awakened to unsurpassed, perfect, complete awakening?”“Not so, Lord; not so, Sugata.”

source: །དེ་བས་ན་དེ་ལྟར་སྐྱེ་བ་རྣམ་པ་གསུམ་གྱི་དབང་གིས་སྐྱེས་ནས་བྱང་ཆུབ་ཀྱི་ཚོགས་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: Therefore, reborn through the power of these three sorts of birth they complete the equipment for awakening. “

source: །འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འབུམ་པ་དང་། ཉི་ཁྲི་ལྔ་སྟོང་པ་དང་། ཁྲི་བརྒྱད་སྟོང་པ་རྒྱ་ཆེར་བཤད་པ་རྫོགས་སོ།། །།
en: The Long Explanation of the Noble Perfection of Wisdom in One Hundred Thousand, Twenty-Five Thousand, and Eighteen Thousand Lines” is completed.

source: རྒྱ་གར་གྱི་མཁན་པོ་སུ་རེནྡྲ་བོ་དྷི་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙཱ་བ་བན་དེ་ཡེ་ཤེས་སྡེས་ཞུས་ཏེ་གཏན་ལ་ཕབ་པའོ།། །།
en: Revised and finalized by the Indian preceptor Surendrabodhi and the chief editor-translator monk Yeshé Dé.
